import { ConteinerMain } from "../HomePages/Home"
import { ColorRing } from 'react-loader-spinner'
import { useState, useEffect } from "react";
import { Loader } from "../../components/App.styled";

const Rules = () => {

     const [loading, setLoading] = useState(false);
 
  useEffect(() => {
    setLoading(true)
    setTimeout(() => {
      setLoading(false)
    }, 300)
  }, [])
    return (
          <div>
            {
                loading ? <Loader><ColorRing
                    visible={true}
                    height="200"
                    width="200"
                    ariaLabel="blocks-loading"
                    wrapperStyle={{}
                    }
                    wrapperClass="blocks-wrapper"
                    colors={['#f8abeb', '#f8abeb', '#f8abeb', '#f8abeb', '#f8abeb']} /></Loader> :
                    <ConteinerMain>
                        < main >
                            <h3>Правила користування приміщеннями в рамках дії Добровільного договору про використання приміщення.</h3>
                            <p>  Дані правила запроваджені з метою належної організації роботи та забезпечення можливості користування приміщенням особами які мають таке право. <br />
                                Дотримання правил - обовязкова умава для всіх без винятку. <br />
                                Право користування приміщенням виникає після відповідної оплати.<br />
                                Оплата здійснюється до початку користування у встановлених розмірах.</p>
                            <p>Під час користування приміщенням Орендар або його вповноважена особа виконує наступні дії та заходи:
                            </p>
                            <ul>
                                <li>Перед початком та після користування оглядає приміщення на предмет сторонніх предметів, осіб, пошкоджень засмічення тощо. Впевнюється в безпеці та належному стані приміщення до та після свого перебування. У випадку необхідності виконує необхідні дії та або повідомити адміністратора про для усунення перешкод для використання приміщення.</li>
                                <li>Зали та приміщення передаються  для  користувачів за 5 хвилин до початку заходу та закриваються через 5 хвилин після терміну закінчення. </li>
                                <li>Утримує площу під час користування у належному технічному і санітарному стані.</li>
                                <li>Складає сміття та відходи в місце для сміття. </li>
                                <li>Дотримуєтьс вимог Закону України „Про захист прав споживачів”, а також самостійно несе відповідальність, в разі порушення вказаного Закону України.
                                </li>
                                <li>Отримує необхідні дозволи та погодження на діяльність.</li>
                                <li>Дотримується «Правил технічної експлуатації електроустановок споживачів», затверджених Наказом Міністерства палива та енергетики України від 25 липня 2006 року № 258, та ДНАОП 0.00-1.21- 98 «Правила безпечної експлуатації електроустановок споживачів», затверджено наказом Державного комітету України по нагляду за охороною праці від 09 січня 1998 року № 4. ( Просто не сунути пальці в розетку та не залишати без нагляду дітей, осіб похилого віку та громадян з обмеженими можливостями).</li>
                                <li>Самостійно виконує вимоги до охорони праці, санітарного стану, електробезпеки, правопорядку, правил пожежної безпеки в Україні, забезпечує проведення протипожежних заходів та дотримання протипожежних вимог, стандартів, норм і правил, монтаж системи пожежогасіння та пожежної сигналізації на площі такого типу, якою є наймана площа, а також самостійно несе відповідальність за дотриманням вказаних вимог, норм і правил перед державними органами.</li>
                                <li>Орендар самостійно вирішує спосіб забезпечення збереження та охорони належного йому майна, товарно-матеріальних цінностей та коштів, здійснює монтаж, обслуговування та поточний ремонт охоронної сигналізації.</li>
                                <li>Орендар несе матеріальну відповідал ьність перед Наймодавцем чи іншими Орендарями за збитки заподіяні пожежею, аварією або нещасним випадком, що виникли з вини Орендаря. Не пізніше місячного терміну відшкодовує в повному обсязі всі матеріальні збитки  заподіяну Наймодавцю та іншим фізичним та юридичним особам, якщо це виникло звини Орендаря.</li>
                                <li>Орендар самостійно несе відповідальність за технічний стан та експлуатацію електроустановок, а також призначає відповідальну особу при необхідності. Спільно з Наймодавцем виготовляє та відповідним чином підписує акт розмежування балансової належності та відповідальності електромереж, та електроустановок, систем водопостачання та водовідведення.</li>
                                <li>В приміщенні забороняється:
                                    <ul>
                                        <li>використовувати найману площу без погодження з Наймодавцем для здійснення спільної діяльності, проведення спільних з третіми особами рекламних компаній, презентацій, виставок, ярмарок що може призвести до великої скупченості відвідувачів, в тому числі і на прилеглій до будівлі території.</li>
                                        <li>Приносити та залишати в залах габаритні речі, вогненебезпечні, легкозаймисті, шкідливі, отруйні та сильнодіючі речовини;
                                        </li>
                                        <li>Використовувати принесені з собою подовжувачі, перехідники та інше електрообладнання, не погоджене для роботи з співробітниками Виконавця, самостійно вмикати та вимикати обладнання у залах;</li>
                                        <li>Без згоди Виконавця, в тому числі, самостійно і необережно, пересувати обладнання та меблі в залах;</li>
                                        <li>Використовувати меблі та обладнання залів не за призначенням або із шкодою для них;</li>
                                        <li>Курити в залах, холах, коридорах та інших не відведених для куріння місцях;</li>
                                        <li>Вживати міцні алкогольні напої;</li>
                                        <li>Заважати проведенню заходів в інших залах;</li>
                                        <li>Бути в поганому гуморі</li>
                                    </ul>
                                </li>
                            </ul>
                            <p>Всі суперечки у зв’язку з цим Договором найму (оренди) вирішуються шляхом переговорів. В випадку недомовленості - відповідно до чинного законодавства України. </p>
                            <p>Користувачі приміщення безумовнот погоджуються з тим що Адміністратор завжди правий. Обовязок ознайомлювати всі причетні особи з правилами користування приміщенням та стежити за дотриманням таких правил, а також ліквідація негативних насідків безумовно приймається до виконання Користувачем приміщення.</p>
                            <p>Орендар не має права передавати обов’язки по Договору найму (оренди) іншим особам або організаціям, а також не здавати передану площу Наймодавця в суборенду, без дозволу Наймодавця. Такий дозвіл оформлюється письмово.</p>
                            <p>Дані правила складені для впорядкування діяльності всіх користувачів та орендарів приміщення з метою якнайкращого якісного задоволення попиту та надання послуг кінцевим споживачам послуг. </p>
                            <p>
                                Всі зміни та доповнення до даних правил   В І Т А Ю Т Ь С Я  , розглядаються та приймаються до виконання після розгляду та затвердження.</p>
                            <p>Редакція №1 від 13 грудня 2022 року.</p>
                        </main >
                    </ConteinerMain>}
            </div>
    )



}
export default Rules;